package com.sist.main;
/*
 *     1. 반복문장이 많다 => 제거
 *        ---------- 메소드
 *        재사용 , 다른 클래스에서 연결 => 한가지 기능만 수행
 *        --------------------- 메소드
 *     2. 관련된 클래스 여러개 => 한개의 객체명으로 처리
 *        -------------- 인터페이스
 *     3. 비정상 종료없이 프로그램 유지 => 예외처리
 *     ----------------------------------------------------
 *     => 변수 => 사이트
 *     --------------
 *        
 */
public class 예외처리_9 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
